-- MySQL dump 10.13  Distrib 5.5.47, for Win32 (x86)
--
-- Host: localhost    Database: news
-- ------------------------------------------------------
-- Server version	5.5.47

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `newss`
--

DROP TABLE IF EXISTS `newss`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `newss` (
  `nid` int(11) NOT NULL AUTO_INCREMENT,
  `tid` int(11) DEFAULT NULL,
  `ntitle` varchar(50) DEFAULT NULL,
  `ncontent` varchar(10000) DEFAULT NULL,
  `nauthor` varchar(50) DEFAULT NULL,
  `ncreatedate` varchar(50) DEFAULT NULL,
  PRIMARY KEY (`nid`)
) ENGINE=MyISAM AUTO_INCREMENT=54 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `newss`
--

LOCK TABLES `newss` WRITE;
/*!40000 ALTER TABLE `newss` DISABLE KEYS */;
INSERT INTO `newss` VALUES (2,2,'外交部驳“中国网络防火墙阻碍国际贸易”言论','<p>\r\n	外交部驳“中国网络防火墙阻碍国际贸易”言论\r\n</p>\r\n<p>\r\n	外交部驳“中国网络防火墙阻碍国际贸易”言论\r\n</p>\r\n<p>\r\n	外交部驳“中国网络防火墙阻碍国际贸易”言论\r\n</p>','作者2','2016-04-01'),(3,1,'近平欢迎瑞士元首访华 与其会谈 会见斯里兰卡总理','近平欢迎瑞士元首访华 与其会谈 会见斯里兰卡总理，近平欢迎瑞士元首访华 与其会谈 会见斯里兰卡总理','作者233','2016-04-13'),(4,2,'山西“不尿任何官员”村支书被开除党籍','<p>\r\n	山西“不尿任何官员”村支书被开除党籍\r\n</p>\r\n<p>\r\n	山西“不尿任何官员”村支书被开除党籍\r\n</p>\r\n<p>\r\n	山西“不尿任何官员”村支书被开除党籍\r\n</p>','作者3','2016-04-03'),(5,3,'警方破获李小璐遭诈捐案 涉案男子或为职业诈捐','<p>\r\n	警方破获李小璐遭诈捐案 涉案男子或为职业诈捐\r\n</p>\r\n<p>\r\n	警方破获李小璐遭诈捐案 涉案男子或为职业诈捐\r\n</p>\r\n<p>\r\n	警方破获李小璐遭诈捐案 涉案男子或为职业诈捐\r\n</p>','作者4','2016-04-04'),(6,3,'日本学生上海遇茶托 喝“48元一口茶”被抢千元','<p>\r\n	日本学生上海遇茶托 喝“48元一口茶”被抢千元\r\n</p>\r\n<p>\r\n	日本学生上海遇茶托 喝“48元一口茶”被抢千元\r\n</p>\r\n<p>\r\n	日本学生上海遇茶托 喝“48元一口茶”被抢千元\r\n</p>','作者5','2016-04-05'),(9,5,'为什么中国不可能建成一流大','<p>\r\n	为什么中国不可能建成一流大\r\n</p>\r\n<p>\r\n	为什么中国不可能建成一流大\r\n</p>\r\n<p>\r\n	为什么中国不可能建成一流大\r\n</p>','作者2','2016-04-12'),(10,5,'中国游客为何义无反顾奔日本两个轮子上的中国百年','<p>\r\n	中国游客为何义无反顾奔日本两个轮子上的中国百年\r\n</p>\r\n<p>\r\n	中国游客为何义无反顾奔日本两个轮子上的中国百年\r\n</p>\r\n<p>\r\n	中国游客为何义无反顾奔日本两个轮子上的中国百年\r\n</p>','作者3','2016-04-07'),(11,6,'P2P美女炫富只是营销魔术','<p>\r\n	P2P美女炫富只是营销魔术\r\n</p>\r\n<p>\r\n	P2P美女炫富只是营销魔术\r\n</p>\r\n<p>\r\n	P2P美女炫富只是营销魔术\r\n</p>','作者4','2016-04-07'),(12,6,'历史漫画：末代帝王之汉献帝——东汉王朝毁于谁手(上)','<p>\r\n	历史漫画：末代帝王之汉献帝——东汉王朝毁于谁手(上)\r\n</p>\r\n<p>\r\n	历史漫画：末代帝王之汉献帝——东汉王朝毁于谁手(上)\r\n</p>\r\n<p>\r\n	历史漫画：末代帝王之汉献帝——东汉王朝毁于谁手(上)\r\n</p>','作者4','2016-04-13'),(13,7,'奥巴马为何用黑莓不用苹果 徕卡的优秀不代表华为成功','<p>\r\n	奥巴马为何用黑莓不用苹果 徕卡的优秀不代表华为成功\r\n</p>\r\n<p>\r\n	奥巴马为何用黑莓不用苹果 徕卡的优秀不代表华为成功\r\n</p>\r\n<p>\r\n	奥巴马为何用黑莓不用苹果 徕卡的优秀不代表华为成功\r\n</p>','作者6','2016-04-13'),(14,7,'换红色平底鞋享受生活 给独自旅行的姑娘们10个忠告','<p>\r\n	换红色平底鞋享受生活 给独自旅行的姑娘们10个忠告\r\n</p>\r\n<p>\r\n	换红色平底鞋享受生活 给独自旅行的姑娘们10个忠告\r\n</p>\r\n<p>\r\n	换红色平底鞋享受生活 给独自旅行的姑娘们10个忠告\r\n</p>','作者7','2016-04-14'),(15,8,'13岁孩子一月花21万','<p>\r\n	13岁孩子一月花21万\r\n</p>\r\n<p>\r\n	13岁孩子一月花21万\r\n</p>\r\n<p>\r\n	13岁孩子一月花21万\r\n</p>','作者6','2016-04-06'),(16,8,'大学生任由骗子摆布','<p>\r\n	大学生任由骗子摆布\r\n</p>\r\n<p>\r\n	大学生任由骗子摆布\r\n</p>\r\n<p>\r\n	大学生任由骗子摆布\r\n</p>','作者8','2016-04-13'),(17,9,'六旬农民工婉拒让','<p>\r\n	六旬农民工婉拒让\r\n</p>\r\n<p>\r\n	六旬农民工婉拒让\r\n</p>\r\n<p>\r\n	六旬农民工婉拒让\r\n</p>','作者9','2016-04-08'),(18,9,'接志愿军遗骸回国','<p>\r\n	接志愿军遗骸回国\r\n</p>\r\n<p>\r\n	接志愿军遗骸回国\r\n</p>\r\n<p>\r\n	接志愿军遗骸回国\r\n</p>','作者9','2016-04-13'),(19,10,'近平欢迎瑞士元首访华 与其会谈 会见斯里兰卡总理','<p>\r\n	近平欢迎瑞士元首访华 与其会谈， 会见斯里兰卡总理近平欢迎瑞士元首访华 与其会谈 会见斯里兰卡总理\r\n</p>\r\n<p>\r\n	近平欢迎瑞士元首访华 与其会谈 会见斯里兰卡总理。\r\n</p>','作者11','2016-04-15'),(20,10,'近平谈党规:从严治党首先要尊崇党章 这三年','<p>\r\n	近平谈党规:从严治党首先要尊崇党章 这三年，近平谈党规:从严治党首先要尊崇党章 这三年&lt;\r\n</p>\r\n<p>\r\n	近平谈党规:从严治党首先要尊崇党章 这三年。\r\n</p>','作者6','2016-04-13'),(21,11,'李克强要求破除互联网+流通四大瓶颈 会见德国外长','李克强要求破除互联网+流通四大瓶颈 会见德国外长，李克强要求破除互联网+流通四大瓶颈 会见德国外长，李克强要求破除互联网+流通四大瓶颈 会见德国外长。','作者12','2016-04-14'),(22,11,'张德江会见瑞士元首 俞正声会见“感恩侨爱”代表','张德江会见瑞士元首 俞正声会见“感恩侨爱”代表，张德江会见瑞士元首 俞正声会见“感恩侨爱”代表，张德江会见瑞士元首 俞正声会见“感恩侨爱”代表。','作者6','2016-04-07'),(23,15,'吴奇隆，刘诗诗大婚','吴奇隆，刘诗诗大婚，吴奇隆，刘诗诗大婚，吴奇隆，刘诗诗大婚','作者23',NULL),(1,1,'13岁孩子一月花21万','13岁孩子一月花21万,13岁孩子一月花21万,13岁孩子一月花21万','作者55','2016-04-12'),(24,12,'外交部驳“中国网络防火墙阻碍国际贸易”言论','外交部驳“中国网络防火墙阻碍国际贸易”言论，外交部驳“中国网络防火墙阻碍国际贸易”言论，外交部驳“中国网络防火墙阻碍国际贸易”言论','记者-1','2016-04-05'),(25,12,'媒体：刚刚用上中国抗旱水 越南就对中国捅刀子','媒体：刚刚用上中国抗旱水 越南就对中国捅刀子，媒体：刚刚用上中国抗旱水 越南就对中国捅刀子，媒体：刚刚用上中国抗旱水 越南就对中国捅刀子','作者3','2016-04-02'),(26,13,'为什么中国不可能建成一流大','为什么中国不可能建成一流大，为什么中国不可能建成一流大，为什么中国不可能建成一流大','作者12','2016-04-07'),(27,13,'近平谈党规:从严治党首先要尊崇党章 这三年','近平谈党规:从严治党首先要尊崇党章 这三年，近平谈党规:从严治党首先要尊崇党章 这三年，近平谈党规:从严治党首先要尊崇党章 这三年','作者14','2016-04-02'),(28,14,'李克强要求破除互联网+流通四大瓶颈 会见德国外长','李克强要求破除互联网+流通四大瓶颈 会见德国外长，李克强要求破除互联网+流通四大瓶颈 会见德国外长，李克强要求破除互联网+流通四大瓶颈 会见德国外长','作者5','2016-04-07'),(29,14,'历史漫画：末代帝王之汉献帝——东汉王朝毁于谁手(上)','历史漫画：末代帝王之汉献帝——东汉王朝毁于谁手(上)，历史漫画：末代帝王之汉献帝——东汉王朝毁于谁手(上)，历史漫画：末代帝王之汉献帝——东汉王朝毁于谁手(上)','作者1','2016-04-14'),(30,15,'警方破获李小璐遭诈捐案 涉案男子或为职业诈捐','警方破获李小璐遭诈捐案 涉警方破获李小璐遭诈捐案 涉案男子或为职业诈捐案男子或为职业诈捐，警方破获李小璐遭诈捐案 涉案男子或为职业诈捐，','作者3','2016-04-05'),(31,16,'奥巴马为何用黑莓不用苹果 徕卡的优秀不代表华为成功','奥巴马为何用黑莓不用苹果 徕卡的优秀不代表华为成功，奥巴马为何用黑莓不用苹果 徕卡的优秀不代表华为成功，奥巴马为何用黑莓不用苹果 徕卡的优秀不代表华为成功','作者44','2016-04-10'),(32,16,'接志愿军遗骸回国','接志愿军遗骸回国，接志愿军遗骸回国，接志愿军遗骸回国','作者23','2016-04-08');
/*!40000 ALTER TABLE `newss` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `topic`
--

DROP TABLE IF EXISTS `topic`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `topic` (
  `tid` int(11) NOT NULL AUTO_INCREMENT,
  `tname` varchar(50) DEFAULT NULL,
  PRIMARY KEY (`tid`)
) ENGINE=MyISAM AUTO_INCREMENT=22 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `topic`
--

LOCK TABLES `topic` WRITE;
/*!40000 ALTER TABLE `topic` DISABLE KEYS */;
INSERT INTO `topic` VALUES (5,'娱乐'),(4,'体育'),(3,'军事'),(2,'国际'),(1,'国内'),(6,'社会'),(7,'财经'),(8,'科技'),(9,'健康'),(10,'汽车'),(11,'教育'),(12,'房产'),(13,'家居'),(14,'旅游'),(15,'文化'),(16,'其他');
/*!40000 ALTER TABLE `topic` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2016-04-24 21:21:06
